Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྒྱ་ཆེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of vastness.

source: རྒྱས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of flourishing.

source: མཐའ་ཡས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six infinite perfections.

source: འཚོལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of searching.

source: རྒལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections for crossing over.

source: མངོན་པར་དགའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of joyfulness.

source: མངོན་པར་དགའ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of joylessness.

source: ཐོས་པ་འཛིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections for the retention of learning.

source: འཁོར་བར་ཡུན་རིང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections for a long stay in saṃsāra.

source: རྒྱུན་ཆད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections without disruption.

source: འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections that are dedicated to ripening as sense pleasures.

source: བསམ་གཏན་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through concentration.

source: མངོན་པར་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of superknowledge.

source: འཇིག་རྟེན་པའི་བཟོའི་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections for mundane fields of artistry.

source: བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through loving kindness.

source: སྙིང་རྗེས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through compassion.

source: དགའ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through joy.

source: བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through equanimity.

source: ལོག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: “There are six perfections dedicated through wrong view.

source: ཡང་དག་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through correct view.

source: གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through the view having supports.

source: མི་གནས་པར་ལྟ་བས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated through the view having no supports.

source: གནས་མེད་པས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections dedicated without support.

source: ང་རྒྱལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections concerning pride.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections arising from patience.

source: ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of benefiting.

source: ཕན་མི་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections without benefit.

source: ལྷག་མ་དང་བཅས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections with remainder.

source: ལྷག་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections without remainder.

source: རིགས་པའི་ཁྱད་པར་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of abiding by distinctive intelligence.

source: སངས་རྒྱས་འབྱུང་བ་ཕུན་སུམ་ཚོགས་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of the excellent appearance of a buddha.

source: དྲན་པ་ཉམས་པ་མེད་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections that maintain recollection.

source: སངས་རྒྱས་འབྱུང་བ་རབ་ཏུ་འཐོབ་པ་ཁྱིམ་གྱི་དངོས་པོ་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of abiding in the household that are receptive to a buddha’s appearance.

source: ངེས་པར་འབྱུང་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of accomplishing deliverance.

source: མང་དུ་ཐོས་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of accomplishing extensive learning.

source: རབ་ཏུ་བྱུང་བའི་ངང་ཚུལ་རྒྱུན་མི་ཆད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of continuously maintaining the appearance of having gone forth.

source: མངོན་པར་ཤེས་པ་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of abiding in superknowledges.

source: མངོན་པར་ཤེས་པ་རྒྱུན་ཆད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of uninterrupted superknowledge.

source: ལུས་འདོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of wishing for a body.

source: ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of endowment.

source: རྣམ་པར་སྨིན་པ་མང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of myriad forms of ripening.

source: དུས་སུ་སྦྱིན་པ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections associated with timely generosity.

source: འོད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of light.

source: འོད་མཐའ་ཡས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of limitless light.

source: རྣམ་པར་སྨིན་པ་བདེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of delightful ripening.

source: དགའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of delight.

source: རྣམ་པར་དག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of purification.

source: འཇིག་རྟེན་པའི་ཆོས་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections that transcend worldly phenomena.

source: སྐྱེ་བ་བཀོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of manifestation by birth.

source: རིགས་ཕུན་སུམ་ཚོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of a perfect family.

source: འཁོར་ཕུན་སུམ་ཚོགས་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections conducive to a perfect retinue.

source: འཁོར་མི་ཕྱེད་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections conducive to an undivided retinue.

source: རྣམ་པར་སྨིན་པ་དག་པ་སྐྱེད་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections that give rise to pure ripening.

source: ཕྱོགས་རྣམ་པར་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of seeing in all directions.

source: ཡོངས་སུ་ཤེས་པ་ཡོངས་སུ་བསྒྲགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of the proclamation of knowledge.

source: བག་ཡོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of carefulness.

source: བརྫི་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of being unharmed.

source: མྱ་ངན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of nirvāṇa.

source: དབང་ཆེ་བར་གྲགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of the proclamation of great mastery.

source: སྐུལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of encouragement.

source: བརྗེད་ངས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of freedom from forgetfulness.

source: མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་དཔེ་བྱད་རྣམས་ཕན་ཚུན་འབྲེལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: “There are six perfections correlated with the thirty-two marks and the signs.

source: མངོན་པར་འབྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of the departure.

source: དུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections based on time.

source: དུས་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections based on knowledge of time.

source: རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of discernment.

source: འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections for harmonizing with the world.

source: རྟོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of realization.

source: སྤོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of relinquishment.

source: རྡོ་རྗེ་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six vajra-like perfections.

source: མུན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of freedom from darkness.

source: ཟིལ་གྱིས་མི་ནོན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of being indomitable.

source: བདུད་ཀྱི་དཔུང་འཇོམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections that conquer the hordes of the māras.

source: གཡོ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of immutability.

source: སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of the single unique moment.

source: མཉམ་པར་མ་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections without equipoise.

source: མཉམ་པར་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of equipoise.

source: ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of ripening.

source: སངས་རྒྱས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of the buddhas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of omniscience.

source: དང་དུ་ལེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of joyful acceptance.

source: རྟོགས་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections that foster realization.

source: ཡིད་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of disenchantment.

source: གཞན་ལ་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections yielding virtue for others.

source: གཞན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོད་དོ། །
en: There are six perfections of others.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡང་དག་པར་སྤོང་བ་རེ་རེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: “Likewise, there are six perfections for each of the correct abandonments.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་པོ་རེ་རེའི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections for each of the bases of miraculous power.

source: བསམ་གཏན་བཞི་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections of the four concentrations.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections of the four applications of mindfulness.

source: བདེན་པ་བཞི་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections of the four truths.

source: དབང་པོ་ལྔ་པོ་རེ་རེའི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections for each of the five faculties.

source: སྟོབས་ལྔ་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections for each of the five powers.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections of the seven factors of awakening.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are also six perfections of the eight limbs of the noble path.

source: ཞི་གནས་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections focused on calm abiding.

source: ལྷག་མཐོང་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections focused on special insight.

source: རིག་པ་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections focused on knowledge.

source: རྣམ་པར་གྲོལ་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of accomplishing liberation.

source: དགེ་སློང་གིས་འཁོར་ཉེ་བར་འོང་བ་སྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections that gather the assembly of a monk.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are six perfections of the four types of correct knowledge.

source: ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of freedom from weariness.

source: སྦྱིན་པ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of deliverance through generosity.

source: ཚུལ་ཁྲིམས་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of deliverance through discipline.

source: བཟོད་པ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of deliverance through patience.

source: བརྩོན་འགྲུས་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of deliverance through diligence.

source: བསམ་གཏན་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of deliverance through concentration.

source: ཤེས་རབ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of deliverance through insight.

source: མིག་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། སེམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: “There are six perfections of the eye, ear, nose, tongue, body, and mind.

source: གཞན་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་ཟང་ཟིང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of material things dedicated to benefiting others.

source: བདག་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་ཟང་ཟིང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of material things dedicated to benefiting oneself.

source: ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the Dharma.

source: དོན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the objectives.

source: རྟོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of realization.

source: སྤྲོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of happiness.

source: སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of emptiness.

source: མཚན་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of signlessness.

source: སྨོན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of wishlessness.

source: གཞན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections that are additional.

source: རྣམ་པར་སྨིན་པ་གཞན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of additional ripening.

source: སྦྱོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of application.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are six perfections of the ten powers of the thus-gone ones.

source: མི་འཇིགས་པ་བཞི་པོ་དག་གི་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are six perfections of the four types of fearlessness.

source: སྙིང་རྗེ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of great compassion.

source: ཤའི་སྤྱན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the physical eye.

source: ལྷའི་སྤྱན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the divine eye.

source: ཤེས་རབ་ཀྱི་སྤྱན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the eye of insight.

source: ཆོས་ཀྱི་སྤྱན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the Dharma eye.

source: སངས་རྒྱས་ཀྱི་སྤྱན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the buddha eye.

source: རང་བྱུང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: “There are six perfections of the self-existent.

source: རྣམ་པར་རོལ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of playfulness.

source: གཏིང་དཔག་དཀའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections that are hard to fathom.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་པོ་རེ་རེའི་འང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དྲུག་གོ། །
en: There are six perfections for each of the eighteen unique qualities of the buddhas.

source: མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of expertise.

source: ཇི་ལྟ་བ་བཞིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of how things are.

source: རང་བཞིན་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of seeing the nature of things.

source: འདོད་པ་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the actions of the desire realm.

source: གཟུགས་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the actions of the form realm.

source: གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the actions of the formless realm.

source: དཀར་པོ་རྣམ་པར་མཐོང་བའི་སའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the level of seeing the virtuous.

source: རིགས་ཀྱི་སའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the qualities of the level of the spiritual potential.

source: བརྒྱད་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the qualities of the eighth.

source: རྒྱུན་དུ་ཞུགས་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the qualities of a stream enterer.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the qualities of a once-returner.

source: ཕྱིར་མི་འོང་བའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the qualities of a non-returner.

source: དགྲ་བཅོམ་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the qualities of a worthy one.

source: རང་སངས་རྒྱས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of a solitary buddha.

source: བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of a bodhisattva.

source: ཟད་པ་ཤེས་པས་རབ་ཏུ་ཕྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of discerning the knowledge of exhaustion.

source: མི་སྐྱེ་བ་ཤེས་པས་རབ་ཏུ་ཕྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of discerning the knowledge of nonarising.

source: བྱིན་གྱི་རླབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of blessings.

source: དམ་པའི་ཆོས་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the continuation of the sacred Dharma.

source: མངོན་པར་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of superknowledge.

source: སྤྱོད་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of conduct.

source: ཕན་པར་འདོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of wishing to benefit.

source: ཉོན་མོངས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of the absence of defilement.

source: སྤངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of abandonment.

source: ཚེའི་འདུ་བྱེད་འདོར་བ་ལ་དབང་སྒྱུར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of mastering the relinquishment of the factors for staying alive.

source: མྱ་ངན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of nirvāṇa.

source: ཆོ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of miraculous display.

source: བསྟན་པ་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of delivering teachings.

source: རིང་བསྲེལ་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: There are six perfections of bringing forth relics.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱ་ཉི་ཤུ་རྩ་གཅིག་པོའི་བསམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ལ་ཁྱད་པར་ཅན་ཉིད་འཐོབ་པར་འགྱུར་རོ། །
en: “Thus, Prāmodyarāja, bodhisattvas reflect on one hundred and twenty-one perfections. Thereby bodhisattva great beings achieve distinction with respect to all phenomena.

source: མཚུངས་པ་མེད་པ་ཉིད་འཐོབ་པར་འགྱུར་རོ། །
en: They achieve the unequaled.

source: གཞན་ལ་རག་མ་ལས་པའི་ཤེས་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ། །
en: They achieve knowledge that does not depend on others.

source: འདུས་བྱས་ཐམས་ཅད་ཟིལ་གྱིས་ཀྱང་གནོན་ལ་སྲིད་པ་ཡང་ཡང་དག་པར་འགྲུབ་པར་བྱེད་དོ། །
en: They overpower all conditioned phenomena and genuinely accomplish existence.

source: ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་རོ། །
en: They accomplish the severance of all doubts.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐོབ་པ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་རོ། །
en: They genuinely accomplish the attainment of omniscience.

source: དེས་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དག་ཡོངས་སུ་རྫོགས་པར་བྱས་པས་ཏིང་ངེ་འཛིན་བརྒྱད་ཁྲི་བཞི་སྟོང་དག་འཐོབ་པར་འགྱུར་རོ། །
en: Thus, perfecting these perfections, they attain eighty thousand absorptions.

source: གཟུངས་ཀྱི་སྒོ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དག་སྒྲུབ་པར་འགྱུར་རོ། །
en: They accomplish eighty thousand gateways of retention.

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པ་ལྔ་བརྒྱ་དག་སྒྲུབ་པར་འགྱུར་རོ། །
en: They accomplish five hundred playful displays of the buddhas.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་ཡུལ་ལ་མཁས་པ་ཉིད་དུ་འགྱུར་རོ། །
en: They become expert regarding the domains of all sentient beings.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡུལ་ངེས་པར་སྟོན་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མདོར་བསྡུས་ཏེ་བཀའ་སྩལ་གྱི་དོན་རྒྱས་པར་ཕྱེ་སྟེ་
en: “Blessed One, you have explained in brief the Dharma teaching known as ‘Elucidating the Objects of the Buddhas.’

source: མ་གསུངས་པས་བདག་གིས་མ་འཚལ་ཏོ། །
en: Yet, since you have not elaborated on its meaning, I fail to comprehend it.

source: དེ་ལྟ་ལགས་པས། བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་དང་། སྐྱེ་བོ་མང་པོ་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་བདེ་བར་འགྱུར་བ་དེ་རྒྱ་ཆེར་ལེགས་པར་བཤད་དུ་གསོལ།
en: Therefore, in order to benefit many beings, to bring happiness to many beings, and to regard many beings with your loving mind, I request the Blessed One to please explain in detail these matters that are meaningful, beneficial, and joyful for gods and humans.”

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་རྒྱ་ཆེར་བཤད་དོ། །
en: “Prāmodyarāja, listen well and keep my teaching in mind. I shall explain in detail.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ་ཞེས་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “Blessed One, I shall do just as you say,” said the bodhisattva Prāmodyarāja, and he proceeded to listen in just that way to the words of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One continued:

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་ལ་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “Prāmodyarāja, what are the six purifying perfections?

source: བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པ་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ལ་དགའ་བའི་ངོ་བོ་ཡིན་ཡང་སྔོན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་སེམས་ཅན་གཞན་སུ་ཡང་རུང་བ་དག་ལ་བྱང་ཆུབ་ཅེས་རབ་ཏུ་རྗོད་པར་མི་བྱེད་ཅིང་སྨོན་པའི་སེམས་ཡོད་པ་གང་ཡིན་པ་དེ་ནི་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅེས་བྱའོ། །
en: They are the six perfections of those who have not yet developed the mind of awakening but who delight in the nature of generosity, discipline, patience, diligence, concentration, and insight for the sake of awakening. Although they have not previously pronounced ‘awakening’ before any complete and perfect buddha or to any sentient being, they do possess the mind.

source: དེ་ལ་སྣང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six illuminating perfections?

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པས་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེ་བ་སྦྱིན་པ་སྔོན་དུ་འགྲོ་བའམ། ཚུལ་ཁྲིམས་སྔོན་དུ་འགྲོ་བའམ། བཟོད་པ་སྔོན་དུ་འགྲོ་བའམ། བརྩོན་འགྲུས་སྔོན་དུ་འགྲོ་བའམ། བསམ་གཏན་སྔོན་དུ་འགྲོ་བའམ། ཤེས་རབ་སྔོན་དུ་འགྲོ་བ་ཞིག་གམ་ཞེས་བདག་ཉིད་དཔྱོད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སྣང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: They are the six perfections of those who have given rise to the qualities of the perfections and the mind of awakening such that they examine whether the development of the mind of awakening is preceded by generosity, discipline, patience, diligence, concentration, or insight.

source: དེ་ལ་འཇིག་རྟེན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six mundane perfections?
